Revit 2024 API
BuiltInFailures.MacroFailures Class
 Failures about module with duplicate name found during reload latest.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class MacroFailures
Visual Basic
Public NotInheritable Class MacroFailures
Visual C++
public ref class MacroFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.MacroFailures
See Also
BuiltInFailures.MacroFailures Members
Autodesk.Revit.DB Namespace